[
  {
    "job_id": "4333497099?position=1&pageNum=0&refId=nb2q%2BP984PXEwfLDKafMfA%3D%3D&trackingId=%2FGF1zX1wewEB%2BifGvMtA3Q%3D%3D",
    "title": "Junior DevOps Specialist",
    "company": "Thales",
    "location": "Ottawa, Ontario, Canada",
    "link": "https://ca.linkedin.com/jobs/view/junior-devops-specialist-at-thales-4333497099?position=1&pageNum=0&refId=nb2q%2BP984PXEwfLDKafMfA%3D%3D&trackingId=%2FGF1zX1wewEB%2BifGvMtA3Q%3D%3D",
    "job_type": "Not specified",
    "seniority_level": "Not specified",
    "industry": "Not specified",
    "description": "Location: Ottawa, CanadaIn fast changing markets, customers worldwide rely on Thales. Thales is a business where brilliant people from all over the world come together to share ideas and inspire each other. In aerospace, transportation, defence, security and space, our architects design innovative solutions that make our tomorrow's possible.For decades, Ottawa has been a global technology leader. Today, Canada’s capital holds one of the brightest and most diverse technological ecosystems in North America. Voted as Canada’s best place to live 2017 by Maclean's, Ottawa offers a low cost of living with a high quality of life. The Thales Ottawa office has been a major supplier and long-term trusted partner to DND, enabling the Canadian Armed Forces and the Canadian Coast Guard to achieve mission success.This is for a hybrid role in Ottawa, ON.Position SummaryWe are seeking a motivatedJunior DevOps specialistwith some experience in automating, configuring, and managing Windows and Linux server environments. In this role, you will assist with implementing and maintaining automation solutions to streamline server configuration, deployment, and management processes using Ansible. You will work closely with senior team members and other teams to help ensure consistency, security, and efficiency across our solutions.Key Areas of ResponsibilityAssist with developing and maintaining Ansible playbooks and roles to automate configuration tasks across Windows and Linux servers under the guidance of senior team members.Contribute to the creation of modular playbooks that support different environments (dev, test, production) as part of a team effort.Learn and apply Ansible best practices by following established standards and practices.Support the integration of Ansible workflows with CI/CD pipelines, collaborating with experienced team members.Help identify and troubleshoot issues related to server configuration and automation with support.Document Ansible playbooks, roles, and workflows for reference and knowledge sharing.Assist in reviewing logs and troubleshooting issues related to automation, servers, or deploymentsBasic QualificationsBachelor’s degree or college diploma in Computer Science, Computer Tech, or Engineering related discipline0 to 3 years of relevant technical experience (recent graduates and early-career professionals are encouraged to apply)Demonstrated problem-solving and analytical skills, with a strong desire to learn new technologies and approachesGood organizational skills, with the ability to manage and prioritize multiple tasks effectivelyComputer proficiency and technical skills may include:Basic knowledge or familiarity with Windows and/or Linux operating systemsFoundational understanding or exposure to scripting or programming (such as Python, Bash, or PowerShell)Basic experience with version control tools, especially GitBasic understanding of working with YAML-based configuration filesAwareness of configuration management tools (such as Ansible) and automation concepts; hands-on experience is a plus, but not requiredInterest in CI/CD pipelines, cloud platforms, and DevOps practicesAwareness of basic networking concepts (such as DNS, IP addressing, ports, and firewalls)Comfortable using VS Code, terminal/shell tools, and basic DevOps utilitiesAbility to build strong working relationships across the business, with a customer-oriented approachExcellent verbal and written communication skills in EnglishPreferred QualificationsExposure to, or basic familiarity with, Windows and/or Linux server administrationInterest in learning or some experience with scripting languages (such as PowerShell, Bash, or Python)Awareness of CI/CD concepts or tools (such as Jenkins, GitLab CI, or similar)Interest in or some familiarity with configuration management tools like Ansible is an assetSome understanding of version control systems, especially GitCuriosity about automation practices (e.g., infrastructure as code, scripting, or CI/CD pipelines); eager to learn new tools and methodsBasic understanding of DevOps concepts and a willingness to build skills in cloud technologies (IaaS, PaaS, SaaS)Awareness of networking and cybersecurity fundamentalsInterest in containers and orchestration platforms (such as Docker or Kubernetes) is an assetWhat We OfferThales provides an extensive benefits program for all full-time employees working 24 or more hours per week and their eligible dependents, including the following:Company paid Extended Health, Dental, HSA, Life, AD&D, Short-term Disability, Cancer Care Program, travel insurance, Employee Assistance Plan and Well-Being program.Retirement Savings Plans (RRSP, DCPP, TFSA) with a company contribution and a match to a DCPP, with no vesting period.Company paid holidays, vacation days, and paid sick leave.Voluntary Life, AD&D, Critical Illness, Long-Term Disability.Employee Discounts on home, auto, and gym membership.Why Join Us?Say HI and learn more about working at Thalesc",
    "description_length": 5000,
    "scraped_at": "2025-11-30 11:22:45",
    "search_job": "devops",
    "search_location": "canada"
  },
  {
    "job_id": "4339295856?position=2&pageNum=0&refId=nb2q%2BP984PXEwfLDKafMfA%3D%3D&trackingId=MwpcojA3JFRDz1r9dkyyRw%3D%3D",
    "title": "Junior Devops Technician (Remote)",
    "company": "Taskify AI",
    "location": "Canada",
    "link": "https://ca.linkedin.com/jobs/view/junior-devops-technician-remote-at-taskify-ai-4339295856?position=2&pageNum=0&refId=nb2q%2BP984PXEwfLDKafMfA%3D%3D&trackingId=MwpcojA3JFRDz1r9dkyyRw%3D%3D",
    "job_type": "Not specified",
    "seniority_level": "Not specified",
    "industry": "Not specified",
    "description": "Job Title: Junior Devops Technician (Remote)Location: Remote(Open to qualified candidates located in theUS, UK, Canada, Australia, New Zealand, Ireland)Compensation:Competitive pay commensurate with experience and role level; specific salary details will be discussed during the hiring process.Role Overview:We are seeking motivated individuals for a 100% remote role to support content development, research, data organisation, and digital workflows. This role involves contributing to writing, editing, and research tasks, and collaborating with cross-functional teams to ensure brand consistency and quality.Key Responsibilities:Write, edit, and proofread engaging and accurate content across various platforms.Conduct thorough research to enhance content quality and relevance.Organise, review, and maintain data and documentation with attention to detail.Assist with project tasks, including content creation, data analysis, and digital coordination.Collaborate with teams to maintain consistent messaging and brand voice.Qualifications:Strong written and verbal communication skills in English.Analytical mindset with excellent attention to detail and accuracy.Ability to work independently and manage time effectively in a remote environment.Flexible and adaptable to various work arrangements (internship, part-time, full-time).Previous experience or education in writing, communications, marketing, or related fields is a plus.Benefits:Flexible remote working schedule tailored to your lifestyle.Opportunities for professional mentorship and skills development.Gain valuable experience and build a portfolio of meaningful projects.Apply Now!Show moreShow less",
    "description_length": 1668,
    "scraped_at": "2025-11-30 11:22:48",
    "search_job": "devops",
    "search_location": "canada"
  },
  {
    "job_id": "4339193547?position=3&pageNum=0&refId=nb2q%2BP984PXEwfLDKafMfA%3D%3D&trackingId=vcdmRY%2FrsTLMME7tIstnFQ%3D%3D",
    "title": "Junior DevOps Engineer (Night Shift)",
    "company": "UniUni",
    "location": "Canada",
    "link": "https://ca.linkedin.com/jobs/view/junior-devops-engineer-night-shift-at-uniuni-4339193547?position=3&pageNum=0&refId=nb2q%2BP984PXEwfLDKafMfA%3D%3D&trackingId=vcdmRY%2FrsTLMME7tIstnFQ%3D%3D",
    "job_type": "Not specified",
    "seniority_level": "Not specified",
    "industry": "Not specified",
    "description": "About UniUniUniUni, a North American leader in last-mile logistics, delivers tens of millions of parcels annually across Canada, from coast to coast, and is rapidly expanding its footprint in the United States. Founded in 2019, UniUni is known for its tech-driven innovation and crowdsourced delivery model, providing fast, economical, and reliable services to local, national, and international e-commerce clients.About The RoleWe are seeking a Junior DevOps Engineer (Night Shift) to join UniUni’s growing team. This role will support and maintain production systems overnight (10:00 PM – 6:00 AM PST, with possible adjustments based on business needs). The ideal candidate holds a degree in Computer Science or a related field, has strong knowledge of AWS and Linux, and is eager to grow their skills in cloud and DevOps. Experience with Terraform, Packer, Ansible, Python, or Golang is a strong asset.What You'll DoMonitor, maintain, and troubleshoot production systems and services during night hours.Assist in deploying, configuring, and managing AWS infrastructure.Perform Linux system administration tasks and ensure server health and availability.Support CI/CD pipelines and operational workflows.Collaborate with the daytime DevOps team by documenting incidents and providing detailed handover notes.For complex system issues, after making an initial assessment of the problem nature, promptly coordinate and assemble the relevant teams to jointly implement emergency mitigation actions and conduct root cause investigations of incidents.QualificationsBachelor’s degree or higher in Computer Science, Software Engineering, or a related field.Solid understanding of AWS services (EC2, S3, RDS, IAM, etc.).Proficiency in Linux system administration.Strong problem-solving and troubleshooting skills.Ability to work independently during night shifts.Good communication and documentation skills.Nice to Have (Assets)Familiarity with Terraform, Packer, Ansible.Programming or scripting experience with Python and/or Golang.Experience with monitoring and alerting systems (e.g., CloudWatch, Prometheus).The Pay Range For This Role Is60,000 - 80,000 CAD per year(Remote (Canada))Show moreShow less",
    "description_length": 2200,
    "scraped_at": "2025-11-30 11:22:51",
    "search_job": "devops",
    "search_location": "canada"
  },
  {
    "job_id": "4335745078?position=4&pageNum=0&refId=nb2q%2BP984PXEwfLDKafMfA%3D%3D&trackingId=RqV7t2cP2MhAlOG8Jk10Bw%3D%3D",
    "title": "Manager, DevOps",
    "company": "EQ Bank | Equitable Bank",
    "location": "Toronto, Ontario, Canada",
    "link": "https://ca.linkedin.com/jobs/view/manager-devops-at-eq-bank-equitable-bank-4335745078?position=4&pageNum=0&refId=nb2q%2BP984PXEwfLDKafMfA%3D%3D&trackingId=RqV7t2cP2MhAlOG8Jk10Bw%3D%3D",
    "job_type": "Not specified",
    "seniority_level": "Not specified",
    "industry": "Not specified",
    "description": "Join a ChallengerBeing a traditional bank just isn’t our thing, so we challenge ourselves to get creative in providing innovative banking solutions for Canadians.How do we get there? With a talented team of inquisitive and agile challengers that break through the status quo. So, if you’re passionate about redefining the future of banking—while having fun—this could be your next big opportunity.Our company continues to grow, and today we serve more than 670,000 people across Canada through Equitable Bank, Canada's Challenger Bank™, and have been around for more than 50 years. Equitable Bank's wholly-owned subsidiary, Concentra Bank, supports credit unions across Canada that serve more than six million members. Together we have over $125 billion in combined assets under management and administration, with a clear mandate to drive change in Canadian banking to enrich people's lives. Our customers have named our EQ Bank digital platform (eqbank.ca) one of the top banks in Canada on the Forbes World's Best Banks list since 2021.The WorkReporting to the Director of DevOps and Platforms, the Manager, DevOps Engineering is responsible for leading and scaling DevOps capabilities across EQB’s technology landscape—while remaining hands-on with architecture, tooling, and incident resolution. This includes ownership of CI/CD pipelines, infrastructure automation, environment reliability, release governance, and operational tooling.This is aplayer-coach role: while managing a high-performing team, you will also personally contribute to critical engineering efforts, help troubleshoot complex issues, and drive implementation of DevOps best practices across multiple application portfolios.The Core Responsibilities!Lead by example: Be actively involved in designing and implementing CI/CD pipelines, automation scripts, and IaC modulesGuide the team in deploying and managing containerized applications in Kubernetes or cloud-native environmentsSupport CloudOps team in Automating infrastructure provisioning using tools such as Terraform, ARM templates, or AnsibleSupport and participate directly in incident response, root cause analysis, and long-term remediation of platform and pipeline issuesCoach, mentor, and grow DevOps engineers in both technical skills and delivery ownershipChampion a culture of observability, SRE principles, and operational readinessContinuously improve build/deploy pipelines to increase speed, reliability, and securityEstablish and maintain a secure, auditable release process aligned with compliance frameworks (PCI, SOC2)Work across teams (Developers, QA, Infra, Product, Security) to ensure alignment and successful deliveryContribute to enterprise-level DevOps strategy and roadmap definitionLet's Talk About You!Bachelor or Master’s degree in Computer Science or Engineering or equivalent8+ years of experience in Operations, DevOps with at least 2-3 years’ in a leadership positionExposure to Agile Development practicesExperience with real-time monitoring of distributed systemsStrong passion for building a DevOps culture, bridging Development and OperationsStrong facilitation, negotiation and consultation skills, including the ability to communicate effectively both verbally and in writing at all levels of the organizationDemonstrated leadership skills with the ability to coach and mentor teamsSound understanding of contemporary development and operations practices, technologies, and methodologiesFamiliar with Infrastructure-as-Code, container-based development, Continuous Integration, Continuous Delivery, Continuous DeploymentStrong analytical and problem-solving skillsExcellent time management, organizational, and multi-tasking skillsExperience with hardware, O/S and SDLC tools such as: Windows VMs, Linux VMs, Docker, Docker Containers, MuleSoft, Java, Java Spring, Springboot, API gateways, Git, GitLab, JIRA, Confluence, Atom, Maven, Jenkins, jUnit, MUnit, SOAP, JSON, Blazemeter, LoadRunner, HPE UFT, JBOSS, Tomcat, Docker Swarm, KubernetesWhat we offer [For full-time permanent roles]💰 Competitive discretionary bonus✨ Market leading RRSP match program🩺 Medical, dental, vision, life, and disability benefits📝 Employee Share Purchase Plan👶🏽 Maternity/Parental top-up while you care for your little one🏝 Generous vacation policy and personal days🖥 Virtual events to connect with your fellow colleagues🎓 Annual professional development allowance and a comprehensive Career Development program💛 A fulfilling opportunity to join one of the top FinTechs and help create a new kind of banking experienceThe incumbent will be working hybrid and in office time will be spent working from Equitable Bank’s additional office space located at2200-25 Ontario Street, Toronto, ON.Equitable Bank is deeply committed to inclusion. Our organization is stronger and our employees thrive when we honour and celebrate everyone’s diverse experiences and perspectives. In tandem with that commitment, we support and encourage our staff to grow not",
    "description_length": 5000,
    "scraped_at": "2025-11-30 11:22:53",
    "search_job": "devops",
    "search_location": "canada"
  },
  {
    "job_id": "4339131696?position=5&pageNum=0&refId=nb2q%2BP984PXEwfLDKafMfA%3D%3D&trackingId=CTqxcTdW%2FXks2lB6yTB7tg%3D%3D",
    "title": "Senior Manager, Cloud Infrastructure and Operations",
    "company": "Metergy Solutions",
    "location": "Toronto, Ontario, Canada",
    "link": "https://ca.linkedin.com/jobs/view/senior-manager-cloud-infrastructure-and-operations-at-metergy-solutions-4339131696?position=5&pageNum=0&refId=nb2q%2BP984PXEwfLDKafMfA%3D%3D&trackingId=CTqxcTdW%2FXks2lB6yTB7tg%3D%3D",
    "job_type": "Not specified",
    "seniority_level": "Not specified",
    "industry": "Not specified",
    "description": "About Metergy Solutions Inc. (“Metergy”)Metergy has the energy, rapid growth and excitement of a startup, together with a rock-solid, recession-proof business that has a 45 year track record. We’re a technology company that drives huge carbon emission reductions. This is a once-in-a-career opportunity.As one of North America’s most experienced submetering providers, Metergy has brought turnkey solutions to clients for over 45 years. Metergy supplies, installs and remotely reads meters to measure individual suite consumption of electricity, water, gas, and thermal energy in multi-residential and commercial buildings, and bills and collects for the cost of commodities and administrative charges for the services provided. The business model allows for long-term recurring revenue through an innovative Submetering as a Service (SaaS) model. Submetering is proven to reduce in-suite energy consumption by 40%, driving decarbonization efforts for Metergy’s clients. This performance has enabled Metergy to issue green bonds and obtain green financing.Positioned as the #1 submeter provider in the New York and Canadian markets, and one of the largest in North America, Metergy has more than 900,000 contracted meters, issues over 4M utility bills annually and has over 500 team members. Metergy is a portfolio company of Brookfield Infrastructure Partners. Brookfield is one of the world’s largest investors, owners and operators of infrastructure assets across the utilities, transport, energy, data and sustainable resources sectors. This sponsorship provides Metergy with access to large-scale capital, infrastructure investment expertise and global reach.Our MissionProvide building owners and occupants with accurate and reliable utility consumption data through market-leading expertise in turnkey submetering and billing, while fostering a workplace with inspired team members empowered to do more good.At Metergy, we don’t just believe in our people; we champion them. When individuals feel valued, supported, and inspired to grow, incredible things happen. That’s why we’re thrilled to be recognized as a Great Place to Work for thesecond consecutive year! This achievement reflects our unwavering commitment to building a workplace that’s respectful, inclusive, and high-performing.Come be part of a team that leads withpassion, thrives onpositivity, and delivers withprecision. We’re proud of who we are and even prouder of where we’re headed.Position SummaryWe are seeking an inspiring Senior Manager, Cloud Infrastructure and Operations, with advanced expertise in Microsoft Azure Cloud architecture, Microsoft 365, and the development of robust processes and procedures for managing cloud ecosystems. This leader will bring strong organizational capabilities to proactively address opportunities and challenges as our business continues to expand. The successful candidate will oversee a team of technical professionals responsible for delivering IT changes across projects, intake processes, and operational requests, ensuring alignment with organizational strategy and business needs.Key ResponsibilitiesProvide strategic and operational leadership for all cloud and on-premise IT infrastructure, including collaboration platformsDrive the implementation of technical and non-technical initiatives to enhance reliability, scalability, and quality of IT servicesOversee and administer IT infrastructure processes, including management of Active Directory, storage systems, Azure cloud, servers, networking, application hosting, data backup, server patching, and infrastructure securityManage and optimize collaboration environments such as Microsoft 365, ensuring seamless user experience and security complianceCollaborate with senior leadership on IT vendor evaluation, procurement, and contract managementStandardize and improve organizational IT processes to boost efficiency and reduce operational costs, especially for storage and server resourcesLead and execute IT infrastructure audits, with a strong understanding of NIST standards and best practicesPlan, direct, and manage all IT functions, including server and network infrastructure, business systems, data management, and end-user support servicesSupport and enhance IT governance frameworks, aligning technology initiatives with business priorities and resource optimizationOversee request for proposal (RFP) and service procurement processes, including vendor selection, contract negotiation, and performance managementDevelop, maintain, and test Disaster Recovery Plans (DRP), ensuring alignment with Business Continuity Plans (BCP) and robust security protocolsManage IT service partners to ensure SLA compliance and lead negotiations with new partners to advance the technology roadmap and cloud migration strategiesChampion the design, support, and continual enhancement of end-user support services, including Help Desk, onsite/virtual support, application packaging, mobile device management, and unified co",
    "description_length": 5000,
    "scraped_at": "2025-11-30 11:22:55",
    "search_job": "devops",
    "search_location": "canada"
  }
]